#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖Success! The configuration is valid.


#### Terraform Plan 📖`success`
#### Checkov 🧪`success`

<details><summary>Show Plan</summary>

```

module.databricks["dbw1"].data.azurerm_subnet.subnet_private_endpoint["databricks_pe1"]: Reading...
module.databricks["dbw1"].data.azurerm_virtual_network.databricks: Reading...
module.databricks["dbw1"].data.azurerm_subnet.subnet_private_endpoint["databricks_pe1"]: Read complete after 0s [id=/subscriptions/fb489ac2-f3a0-47da-9d84-977c7f38e1ce/resourceGroups/elex-demo-eu2-rg-0001/providers/Microsoft.Network/virtualNetworks/elex-demo-eu2-vnet-0001/subnets/elex-demo-eu2-snet-0002]
module.databricks["dbw1"].data.azurerm_virtual_network.databricks: Read complete after 0s [id=/subscriptions/fb489ac2-f3a0-47da-9d84-977c7f38e1ce/resourceGroups/elex-demo-eu2-rg-0001/providers/Microsoft.Network/virtualNetworks/elex-demo-eu2-vnet-0001]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.databricks["dbw1"].azurerm_databricks_workspace.databricks will be created
  + resource "azurerm_databricks_workspace" "databricks" {
      + customer_managed_key_enabled          = false
      + disk_encryption_set_id                = (known after apply)
      + id                                    = (known after apply)
      + infrastructure_encryption_enabled     = false
      + location                              = "eastus"
      + managed_disk_identity                 = (known after apply)
      + managed_resource_group_id             = (known after apply)
      + managed_resource_group_name           = "elex-demo-eu2-rg-0005"
      + name                                  = "elex-demo-eu-dbw-0001"
      + network_security_group_rules_required = (known after apply)
      + public_network_access_enabled         = true
      + resource_group_name                   = "elex-demo-eu2-rg-0001"
      + sku                                   = "trial"
      + storage_account_identity              = (known after apply)
      + tags                                  = {
          + "CostCenter"  = "CostCenter code"
          + "application" = "demo app name"
          + "department"  = "Example dept"
          + "environment" = "demo"
          + "owner"       = "Example Project owner"
        }
      + workspace_id                          = (known after apply)
      + workspace_url                         = (known after apply)

      + custom_parameters {
          + nat_gateway_name                                     = (known after apply)
          + no_public_ip                                         = true
          + private_subnet_name                                  = "elex-demo-eu2-snet-0002"
          + private_subnet_network_security_group_association_id = "/subscriptions/fb489ac2-f3a0-47da-9d84-977c7f38e1ce/resourceGroups/elex-demo-eu2-rg-0001/providers/Microsoft.Network/networkSecurityGroups/elex-demo-nsg"
          + public_ip_name                                       = (known after apply)
          + public_subnet_name                                   = "elex-demo-eu2-snet-0001"
          + public_subnet_network_security_group_association_id  = "/subscriptions/fb489ac2-f3a0-47da-9d84-977c7f38e1ce/resourceGroups/elex-demo-eu2-rg-0001/providers/Microsoft.Network/networkSecurityGroups/elex-demo-nsg"
          + storage_account_name                                 = "elexdemoeu2sa0012"
          + storage_account_sku_name                             = "Standard_LRS"
          + virtual_network_id                                   = "/subscriptions/fb489ac2-f3a0-47da-9d84-977c7f38e1ce/resourceGroups/elex-demo-eu2-rg-0001/providers/Microsoft.Network/virtualNetworks/elex-demo-eu2-vnet-0001"
          + vnet_address_prefix                                  = (known after apply)
        }
    }

  # module.databricks["dbw1"].azurerm_private_endpoint.pep["databricks_pe1"] will be created
  + resource "azurerm_private_endpoint" "pep" {
      + custom_dns_configs       = (known after apply)
      + id                       = (known after apply)
      + location                 = "eastus"
      + name                     = "databricks"
      + network_interface        = (known after apply)
      + private_dns_zone_configs = (known after apply)
      + resource_group_name      = "elex-demo-eu2-rg-0001"
      + subnet_id                = "/subscriptions/fb489ac2-f3a0-47da-9d84-977c7f38e1ce/resourceGroups/elex-demo-eu2-rg-0001/providers/Microsoft.Network/virtualNetworks/elex-demo-eu2-vnet-0001/subnets/elex-demo-eu2-snet-0002"

      + private_dns_zone_group {
          + id                   = (known after apply)
          + name                 = "adbzonegroup"
          + private_dns_zone_ids = [
              + "/subscriptions/fb489ac2-f3a0-47da-9d84-977c7f38e1ce/resourceGroups/elex-demo-eu2-rg-0001/providers/Microsoft.Network/privateDnsZones/privatelink.databricks.azure.net",
            ]
        }

      + private_service_connection {
          + is_manual_connection           = false
          + name                           = "databricks-service-connection"
          + private_connection_resource_id = (known after apply)
          + private_ip_address             = (known after apply)
          + subresource_names              = [
              + "databricks_ui_api",
            ]
        }
    }

Plan: 2 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tf.plan

To perform exactly these actions, run the following command to apply:
    terraform apply "tf.plan"

```

</details>

<details><summary>Show Checkov Results</summary>


       _               _              
   ___| |__   ___  ___| | _______   __
  / __| '_ \ / _ \/ __| |/ / _ \ \ / /
 | (__| | | |  __/ (__|   < (_) \ V / 
  \___|_| |_|\___|\___|_|\_\___/ \_/  
                                      
By bridgecrew.io | version: 2.4.36 

Wrote output in SARIF format to the file 'results.sarif'

</details>

*Pushed by: @amro-acc, Action: `pull_request`, Workflow: `Dev-Apply-Data`*